Tests/Tube-With-Inlet/0/constr.include
    empty
    {
	type		empty;
    }
