Tests/Tube-With-Inlet/0/rhoE
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      rhoE;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 253186.670668;

boundaryField
{
    inlet
    {
        type            calculated;
        value           uniform 246883.481243;
    }
    outlet
    {
        type            calculated;
        value           uniform 253186.670668;
    }
    empty
    {
        type            empty;
    }
}


// ************************************************************************* //
